document.write("<br/>...................邮编......................<br/>")
var str="000518";
var reg=new RegExp("^[0-9]{6,}$");
document.write(reg.test(str));
document.write("<br/>...................日期......................<br/>")
var str1="2015-10-26";
var reg1=new RegExp("[0-9]{4}-[0-9]{1,2}-[0-9]{1,2}");//还可以用转义的方法var reg1=new RegExp("\\d{4}-\\d{1,2}-\\d{1,2}").
document.write(reg1.test(str1));
//注意：日期后面再加其他内容也会输出true，这里要是输入日期格式正确，必须在正则表达市里面加上^开始符和$结束符，例：
var str1="2015-10-26";
var reg1=new RegExp("^[0-9]{4}-[0-9]{1,2}-[0-9]{1,2}$");//还可以用转义的方法var reg1=new RegExp("\\d{4}-\\d{1,2}-\\d{1,2}").
document.write(reg1.test(str1));
//以上例子说明为了规范日期书写格式正确，必须添加开始和结束符，因为在上面的例子中，str1里面日期后面如果再加其他内容 也会显示true，因为匹配里面包含了前面的内容，所以会是true  。
//  以上例子可以在很多地方用到例如身份证  邮箱 日期等等

